import React from 'react';

// 모음 사전

const VowelDictionary = () => {
  const solution = (word) => {
    // 알파벳 단어 순서가 담긴 배열
    const arr = ['A', 'E', 'I', 'O', 'U'];

    // word알파벳 index에 곱할 가중치 배열
    let weighted = [5 ** 4, 5 ** 3, 5 ** 2, 5 ** 1, 5 ** 0];

    // 문자열 word를 배열로 치환후 순회
    return word
      .split('')
      .map((v, i) => {
        // ex ) i === 0 이라면 weighted의 0번째 인덱스부터 마지막 인덱스까지
        // 값을 더하고 arr안에 v의 인덱스를 곱한다음 + 1
        return weighted.slice(i).reduce((a, b) => a + b) * arr.indexOf(v) + 1;
      })
      .reduce((a, b) => a + b);
  };
  // arr = [A = 0, E = 1, I = 2, O = 3, U = 4]

  // 문재 해결 방법은 word 요소의 index를 구해서
  // 가중치 배열인 weighted의 index부터 마지막 값을 더한 다음
  // word의 요소가 arr의 몇 번째 값인지 구하고 그 값을
  // weighted의 index부터 마지막 값을 더한 값에 곱하면 됩니다

  // word의 0번째 인덱스는 781의 가중치를 가집니다
  // A = 1
  // E = A + 781 = 782
  // I = E + 781 = 1563
  // O = I + 781 = 2344
  // U = O + 781 = 3125

  // word의 1번째 인덱스는 156의 가중치
  // AA = 2
  // AE = AA + 156 = 158
  // AI = AE + 156 = 314
  // AO = AI + 156 = 470
  // AU = AO + 156 = 626

  // word의 2번째 인덱스는 31의 가중치
  // AAA = 3
  // AAE = AAA + 31 = 34
  // AAI = AAE + 31 = 65
  // AAO = AAI + 31 = 96
  // AAU = AAO + 31 = 127

  // word의 3번째 인덱스는 6의 가중치
  // AAAA = 4
  // AAAE = AAAA + 6 = 10
  // AAAI = AAAE + 6 = 16
  // AAAO = AAAI + 6 = 22
  // AAAU = AAAO + 6 = 28

  // word의 마지막 인덱스는 1의 가중치
  // AAAAA = 5
  // AAAAE = AAAAA + 1 = 6
  // AAAAI = AAAAE + 1 = 7
  // AAAAO = AAAAI + 1 = 8
  // AAAAU = AAAAO + 1 = 9

  // word = AAAAA
  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 0 + 1 = 781 * 0( A ) + 1 = 1
  // ( 125 + 25 + 5 + 1 ) * 0 + 1 = 156 * 0( A ) + 1 = 1
  // ( 25 + 5 + 1 ) * 0 + 1 = 31 * 0( A ) + 1 = 1
  // ( 5 + 1 ) * 0 + 1 = 6 * 0( A ) + 1 = 1
  // ( 1 ) * 0 + 1 = 781 * 0( A ) + 1 = 1
  // [ 1 + 1 + 1 + 1 + 1 ] = 5

  // AAAAE = 6

  // word = AAAAE
  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 0 + 1 = 781 * 0( A ) + 1 = 1
  // ( 125 + 25 + 5 + 1 ) * 0 + 1 = 156 * 0( A ) + 1 = 1
  // ( 25 + 5 + 1 ) * 0 + 1 = 31 * 0( A ) + 1 = 1
  // ( 5 + 1 ) * 0 + 1 = 6 * 0( A ) + 1 = 1
  // ( 1 ) * 1( E ) + 1 = 1 * 1( E ) + 1 = 2
  // [ 1 + 1 + 1 + 1 + 2 ] = 6

  // AAAAI = 7
  // AAAAO = 8
  // AAAAU = 9

  // AAAE = 10

  // word = AAAE
  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 0 + 1 = 781 * 0( A ) + 1 = 1
  // ( 125 + 25 + 5 + 1 ) * 0 + 1 = 156 * 0( A ) + 1 = 1
  // ( 25 + 5 + 1 ) * 0 + 1 = 31 * 0( A ) + 1 = 1
  // ( 5 + 1 ) * 1 + 1 = 6 * 1( E ) + 1 = 7
  // [ 1 + 1 + 1 + 7 ] = 5

  // AAAEA = 11

  // AAAI = 16
  // AAAIA = 17

  // AAAO = 22
  // AAAOA = 23

  // AAAU = 28
  // AAAUA = 29

  // AAE = 34
  // AAEAA = 35

  // E = 782

  // word = E
  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 1( E ) + 1 = 781 * 1( E ) + 1 = 782
  // [ 782 ] = 782

  // EIO = 1189

  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 1( E ) + 1 = 781 * 1( E ) + 1 = 782
  // ( 125 + 25 + 5 + 1 ) * 2( I ) + 1 = 156 * 2( I ) + 1 = 313
  // ( 25 + 5 + 1 ) * 3( O ) + 1 = 31 * 3( O ) + 1 = 94
  // [ 782, 313, 94 ] = 1189

  // I = 1563

  // word = I
  // weighted = [ 625, 125, 25, 5, 1 ]
  // ( 625 + 125 + 25 + 5 + 1 ) * 2 + 1 = 781 * 2( I ) + 1 = 1563
  // [ 1563 ] = 1563

  return <div></div>;
};

export default VowelDictionary;
